
#Область ПрограммныйИнтерфейс

&После("ПриОпределенииОбъектовСКомандамиОбъединенияДублейЗаменыСсылок")
Процедура ИвЦСМ_ПриОпределенииОбъектовСКомандамиОбъединенияДублейЗаменыСсылок(Объекты)

	Объекты.Добавить(Метаданные.Справочники.БанковскиеИКазначейскиеСчета);
	Объекты.Добавить(Метаданные.Справочники.ЛицевыеСчета);
	Объекты.Добавить(Метаданные.Справочники.Договоры);
	Объекты.Добавить(Метаданные.Справочники.Контрагенты);
	Объекты.Добавить(Метаданные.Справочники.Казначейства);
	Объекты.Добавить(Метаданные.Справочники.Номенклатура);
	Объекты.Добавить(Метаданные.Справочники.Подразделения);
	Объекты.Добавить(Метаданные.Справочники.Сотрудники);
	Объекты.Добавить(Метаданные.Справочники.ФизическиеЛица);
	Объекты.Добавить(Метаданные.Справочники.ЮридическиеЛица);
	
	Объекты.Добавить(Метаданные.Документы.АктОбОказанииУслуг);
	Объекты.Добавить(Метаданные.Документы.СчетНаОплату);
	Объекты.Добавить(Метаданные.Документы.СчетФактураВыданный);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
