
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьРеквизитовКонтрагента")
Процедура ИвЦСМ_УстановитьВидимостьРеквизитовКонтрагента()

	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда

		Элементы.РеквизитыЮридическогоЛица.Видимость = Ложь;

		Если ПравоДоступа("Просмотр", Метаданные.Справочники.ФизическиеЛица) Тогда 

			Элементы.РеквизитыФизическогоЛица.Видимость = Истина;

			ЭтоИностранноеФЛ = НЕ (ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
			ИЛИ ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));

			Элементы.ГруппаРегНомераИностранца.Видимость 			= ЭтоИностранноеФЛ;
			Элементы.ФизическоеЛицоНаименованиеЛатиницей.Видимость 	= ЭтоИностранноеФЛ;

			Элементы.ЗаполнитьПоИННФЛ.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
			И НЕ ЭтоИностранноеФЛ
			И ЗначениеЗаполнено(ФизическоеЛицо.ИНН)
#Удаление
			И ЗначениеЗаполнено(ФизическоеЛицо.ОГРНИП)
#КонецУдаления
			И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;

			Элементы.ФизическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;

		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РеквизитыФизическогоЛица", "Видимость", Ложь);
		КонецЕсли;	

	Иначе

		Элементы.РеквизитыФизическогоЛица.Видимость 	= Ложь;	
		Элементы.РеквизитыЮридическогоЛица.Видимость 	= Истина;

		ЭтоИностраннаяОрганизация = НЕ (ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));

		Элементы.ГруппаРеквизитыИностраннойОрганизации.Видимость 	=  ЭтоИностраннаяОрганизация;
		Элементы.БюджетныеРеквизиты.Видимость 						= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ПризнакАдминистратораНачислений.Видимость 			= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ЮридическоеЛицоКодОКПО.Видимость 					= НЕ ЭтоИностраннаяОрганизация;

		Элементы.ЗаполнитьПоИНН.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

		Элементы.КнопкаЗаполнитьРеквизитыПоНаименованию.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

		Элементы.ЮридическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

	КонецЕсли;

	Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость = ОтобразитьЗаполнениеПоДаннымЕГР; 

	Если НЕ Параметры.Ключ.Пустая() Тогда
		Элементы.ИзменитьВидКонтрагента.Видимость 	= ЗначениеЗаполнено(Объект.ВидКонтрагента) И ДоступныеВидыКонтрагентов.Количество() > 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти